CarmaAPI/src/test/resources/soap/added-segments.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns0:carmaRecord xmlns:ns0="http://tempuri.org/">
			<ns1:header xmlns:ns1="http://edims.corepoint.com/carma">
				<ns1:version>0.2</ns1:version>
				<ns1:sourceSystem>RCC</ns1:sourceSystem>
				<ns1:environment>DEV</ns1:environment>
				<ns1:messageType>Carma-Record</ns1:messageType>
				<ns1:timeZone>utc</ns1:timeZone>
				<ns1:patientStatus>New</ns1:patientStatus>
				<ns1:sourceSystemRecordId>1022</ns1:sourceSystemRecordId>
				<ns1:createdAt>8/29/2015 3:01:40 PM</ns1:createdAt>
				<ns1:machine>SMS-LAP-0004</ns1:machine>
			</ns1:header>
			<ns1:patientInfo xmlns:ns1="http://edims.corepoint.com/carma">
				<ns1:PatientRecordId>123</ns1:PatientRecordId>
				<ns1:PatientFirstName>123</ns1:PatientFirstName>
				<ns1:PatientLastName>123</ns1:PatientLastName>
				<ns1:SocialSecurityNumber>123</ns1:SocialSecurityNumber>
				<ns1:DateOfBirth>8/29/2015</ns1:DateOfBirth>
				<ns1:PatientGender>Male</ns1:PatientGender>
				<ns1:PatientCell>123</ns1:PatientCell>
				<ns1:PatientSecondaryPhone>123444</ns1:PatientSecondaryPhone>
				<ns1:PatientEmail>123@fff.com</ns1:PatientEmail>
				<ns1:PatientAddress1>123</ns1:PatientAddress1>
				<ns1:PatientAddress2>123</ns1:PatientAddress2>
				<ns1:City>123</ns1:City>
				<ns1:State>123</ns1:State>
				<ns1:Zip>12345</ns1:Zip>
				<ns1:PatientHeightFeet>123.00</ns1:PatientHeightFeet>
				<ns1:PatientHeightInches>123.00</ns1:PatientHeightInches>
				<ns1:PatientWeight>123.00</ns1:PatientWeight>
				<ns1:PatientTrackingId>123</ns1:PatientTrackingId>
				<ns1:SenderFacilityId>4</ns1:SenderFacilityId>
				<ns1:HosptialName>123</ns1:HosptialName>
				<ns1:HospitalEMR>123</ns1:HospitalEMR>
				<ns1:HospitalFIN>123</ns1:HospitalFIN>
				<ns1:HomePhone>123</ns1:HomePhone>
				<ns1:PrimaryCare>123</ns1:PrimaryCare>
				<ns1:PrimaryCareRelationship>123</ns1:PrimaryCareRelationship>
				<ns1:PrimaryCarePhone>123</ns1:PrimaryCarePhone>
				<ns1:PrimaryCareEmail>123@fff.com</ns1:PrimaryCareEmail>
				<ns1:PCPName>123</ns1:PCPName>
				<ns1:PCPAddress>123</ns1:PCPAddress>
				<ns1:PCPPhone>123</ns1:PCPPhone>
				<ns1:PCPEmail>123@fff.com</ns1:PCPEmail>
				<ns1:InPatientAdmitDate>123</ns1:InPatientAdmitDate>
				<ns1:InPatientDischargeDate>123</ns1:InPatientDischargeDate>
				<ns1:InPatientCareType>123</ns1:InPatientCareType>
				<ns1:InPatientAdmitDiagnosis>123</ns1:InPatientAdmitDiagnosis>
				<ns1:HospitalAssignedDRG>123</ns1:HospitalAssignedDRG>
				<ns1:AMRFacilityId>123</ns1:AMRFacilityId>
				<ns1:AMRRecordNo>123</ns1:AMRRecordNo>
				<ns1:AmrFacilityName>123</ns1:AmrFacilityName>
				<ns1:HospiceRecordNo>123</ns1:HospiceRecordNo>
				<ns1:HospiceFacilityId>123</ns1:HospiceFacilityId>
				<ns1:HospiceFacilityName>123</ns1:HospiceFacilityName>
			</ns1:patientInfo>
			<ns1:referralInfo xmlns:ns1="http://edims.corepoint.com/carma">
				<ns1:ReferralId>1</ns1:ReferralId>
				<ns1:ReferralNumber>123</ns1:ReferralNumber>
				<ns1:TrackingNumber>123</ns1:TrackingNumber>
				<ns1:ReferralType>OutPatient</ns1:ReferralType>
				<ns1:CurrentStatus>Referral</ns1:CurrentStatus>
				<ns1:SenderFacilityId>1</ns1:SenderFacilityId>
				<ns1:SenderFacilityName>123</ns1:SenderFacilityName>
				<ns1:SenderUserId>1</ns1:SenderUserId>
				<ns1:SenderName>123</ns1:SenderName>
				<ns1:ReceiverFacilityId>1</ns1:ReceiverFacilityId>
				<ns1:RecieverFacilityName>123</ns1:RecieverFacilityName>
				<ns1:ReceiverUserId>123</ns1:ReceiverUserId>
				<ns1:RecieverName>123</ns1:RecieverName>
				<ns1:ExpirationOption>123</ns1:ExpirationOption>
				<ns1:ReferralExpirationTime>12-12-15</ns1:ReferralExpirationTime>
				<ns1:PublishType>1</ns1:PublishType>
				<ns1:CancelReason>123</ns1:CancelReason>
				<ns1:OtherCancelrefReason>123</ns1:OtherCancelrefReason>
				<ns1:ReferralAssessment>123</ns1:ReferralAssessment>
				<ns1:ReferralReminderDate>12-12-16</ns1:ReferralReminderDate>
				<ns1:ExpectedDischargeDate>12-12-15</ns1:ExpectedDischargeDate>
				<ns1:ActualDischargeDate>12-12-15</ns1:ActualDischargeDate>
				<ns1:Diagnosis>123</ns1:Diagnosis>
				<ns1:FollowUpRequired>true</ns1:FollowUpRequired>
				<ns1:ScheduledInLogis>true</ns1:ScheduledInLogis>
				<ns1:ServiceProvider>123</ns1:ServiceProvider>
				<ns1:ReferralExtrasId>1</ns1:ReferralExtrasId>
				<ns1:VisitedPatientatHospital>true</ns1:VisitedPatientatHospital>
				<ns1:SpecialInstructions>123</ns1:SpecialInstructions>
				<ns1:ChartBuiltInCERNER>true</ns1:ChartBuiltInCERNER>
				<ns1:MeetsCriteria>true</ns1:MeetsCriteria>
				<ns1:SignedConsentForm>true</ns1:SignedConsentForm>
				<ns1:ReferralTypeName>123</ns1:ReferralTypeName>
				<ns1:ProviderAssigned>true</ns1:ProviderAssigned>
				<ns1:WelcomeCall>true</ns1:WelcomeCall>
				<ns1:Orders>123</ns1:Orders>
				<ns1:OrdersEntered>true</ns1:OrdersEntered>
				<ns1:FollowUpCall>true</ns1:FollowUpCall>
				<ns1:DischargeFormServiceCall>123</ns1:DischargeFormServiceCall>
				<ns1:UnplannedVisitName>123</ns1:UnplannedVisitName>
				<ns1:ReferralSourceType>123</ns1:ReferralSourceType>
				<ns1:ReferralSourcePts>123</ns1:ReferralSourcePts>
				<ns1:CancelReferralReason>123</ns1:CancelReferralReason>
				<ns1:RehabFacilityName>123</ns1:RehabFacilityName>
				<ns1:Paramedic>123</ns1:Paramedic>
				<ns1:ReAdmitToHospital>123</ns1:ReAdmitToHospital>
				<ns1:ChronicCareManager>123</ns1:ChronicCareManager>
				<ns1:IsPatientatHospital>true</ns1:IsPatientatHospital>
				<ns1:PatientLocation>123</ns1:PatientLocation>
				<ns1:SuspectedDrg>123</ns1:SuspectedDrg>
				<ns1:ReferralContract>123</ns1:ReferralContract>
				<ns1:ServiceContractPeriod>123</ns1:ServiceContractPeriod>
				<ns1:DeveroMRN>123</ns1:DeveroMRN>
				<ns1:diagnosisInfo>
					<ns1:ICDs>
						<ns1:DiagnosisID>123</ns1:DiagnosisID>
						<ns1:DiagnosisType>icd-9</ns1:DiagnosisType>
					</ns1:ICDs>
					<ns1:ICDs>
						<ns1:DiagnosisID>123</ns1:DiagnosisID>
						<ns1:DiagnosisType>icd-9</ns1:DiagnosisType>
					</ns1:ICDs>
					<ns1:ICDs>
						<ns1:DiagnosisID>123</ns1:DiagnosisID>
						<ns1:DiagnosisType>icd-10</ns1:DiagnosisType>
					</ns1:ICDs>
					<ns1:ICDs>
						<ns1:DiagnosisID>123</ns1:DiagnosisID>
						<ns1:DiagnosisType>icd-10</ns1:DiagnosisType>
					</ns1:ICDs>
					<ns1:OtherDiagnostics>123</ns1:OtherDiagnostics>
				</ns1:diagnosisInfo>
				<ns1:hospitalInfo>
					<ns1:RoomNo>123</ns1:RoomNo>
					<ns1:RoomLocation>123</ns1:RoomLocation>
					<ns1:MedicalRecordNumber>123</ns1:MedicalRecordNumber>
				</ns1:hospitalInfo>
				<ns1:dischargeInfo>
					<ns1:DischargeInfoId>123</ns1:DischargeInfoId>
					<ns1:ReferralTrackerId>123</ns1:ReferralTrackerId>
					<ns1:DischartgeToType>Home</ns1:DischartgeToType>
					<ns1:DischargeWithType>123</ns1:DischargeWithType>
					<ns1:AgencyName>123</ns1:AgencyName>
					<ns1:AgencyAddress>123</ns1:AgencyAddress>
					<ns1:AgencyPhone>123</ns1:AgencyPhone>
					<ns1:AgencyFAX>123</ns1:AgencyFAX>
					<ns1:FacilityTypeId>123</ns1:FacilityTypeId>
					<ns1:FacilityType>123</ns1:FacilityType>
					<ns1:FacilityName>123</ns1:FacilityName>
					<ns1:FacilityAddress>123</ns1:FacilityAddress>
					<ns1:FacilityCity>123</ns1:FacilityCity>
					<ns1:FacilityZip>12345</ns1:FacilityZip>
					<ns1:FacilityPhone>123</ns1:FacilityPhone>
					<ns1:FacilityFax>123</ns1:FacilityFax>
					<ns1:FacilityState>123</ns1:FacilityState>
					<ns1:PostAcuteProvider>123</ns1:PostAcuteProvider>
					<ns1:RemindDays>123</ns1:RemindDays>
					<ns1:DischargeDate>12-12-16</ns1:DischargeDate>
					<ns1:TransferDate>12-12-15</ns1:TransferDate>
				</ns1:dischargeInfo>
				<ns1:dischargeInfo>
					<ns1:DischargeInfoId>123</ns1:DischargeInfoId>
					<ns1:ReferralTrackerId>123</ns1:ReferralTrackerId>
					<ns1:DischartgeToType>Home</ns1:DischartgeToType>
					<ns1:DischargeWithType>123</ns1:DischargeWithType>
					<ns1:AgencyName>123</ns1:AgencyName>
					<ns1:AgencyAddress>123</ns1:AgencyAddress>
					<ns1:AgencyPhone>123</ns1:AgencyPhone>
					<ns1:AgencyFAX>123</ns1:AgencyFAX>
					<ns1:FacilityTypeId>123</ns1:FacilityTypeId>
					<ns1:FacilityType>123</ns1:FacilityType>
					<ns1:FacilityName>123</ns1:FacilityName>
					<ns1:FacilityAddress>123</ns1:FacilityAddress>
					<ns1:FacilityCity>123</ns1:FacilityCity>
					<ns1:FacilityZip>12345</ns1:FacilityZip>
					<ns1:FacilityPhone>123</ns1:FacilityPhone>
					<ns1:FacilityFax>123</ns1:FacilityFax>
					<ns1:FacilityState>123</ns1:FacilityState>
					<ns1:PostAcuteProvider>123</ns1:PostAcuteProvider>
					<ns1:RemindDays>123</ns1:RemindDays>
					<ns1:DischargeDate>12-12-16</ns1:DischargeDate>
					<ns1:TransferDate>12-12-15</ns1:TransferDate>
				</ns1:dischargeInfo>
				<ns1:dischargeInfo>
					<ns1:DischargeInfoId>123</ns1:DischargeInfoId>
					<ns1:ReferralTrackerId>123</ns1:ReferralTrackerId>
					<ns1:DischartgeToType>Home</ns1:DischartgeToType>
					<ns1:DischargeWithType>123</ns1:DischargeWithType>
					<ns1:AgencyName>123</ns1:AgencyName>
					<ns1:AgencyAddress>123</ns1:AgencyAddress>
					<ns1:AgencyPhone>123</ns1:AgencyPhone>
					<ns1:AgencyFAX>123</ns1:AgencyFAX>
					<ns1:FacilityTypeId>123</ns1:FacilityTypeId>
					<ns1:FacilityType>123</ns1:FacilityType>
					<ns1:FacilityName>123</ns1:FacilityName>
					<ns1:FacilityAddress>123</ns1:FacilityAddress>
					<ns1:FacilityCity>123</ns1:FacilityCity>
					<ns1:FacilityZip>12345</ns1:FacilityZip>
					<ns1:FacilityPhone>123</ns1:FacilityPhone>
					<ns1:FacilityFax>123</ns1:FacilityFax>
					<ns1:FacilityState>123</ns1:FacilityState>
					<ns1:PostAcuteProvider>123</ns1:PostAcuteProvider>
					<ns1:RemindDays>123</ns1:RemindDays>
					<ns1:DischargeDate>12-12-16</ns1:DischargeDate>
					<ns1:TransferDate>12-12-15</ns1:TransferDate>
				</ns1:dischargeInfo>
				<ns1:dischargeInfo>
					<ns1:DischargeInfoId>123</ns1:DischargeInfoId>
					<ns1:ReferralTrackerId>123</ns1:ReferralTrackerId>
					<ns1:DischartgeToType>Home</ns1:DischartgeToType>
					<ns1:DischargeWithType>123</ns1:DischargeWithType>
					<ns1:AgencyName>123</ns1:AgencyName>
					<ns1:AgencyAddress>123</ns1:AgencyAddress>
					<ns1:AgencyPhone>123</ns1:AgencyPhone>
					<ns1:AgencyFAX>123</ns1:AgencyFAX>
					<ns1:FacilityTypeId>123</ns1:FacilityTypeId>
					<ns1:FacilityType>123</ns1:FacilityType>
					<ns1:FacilityName>123</ns1:FacilityName>
					<ns1:FacilityAddress>123</ns1:FacilityAddress>
					<ns1:FacilityCity>123</ns1:FacilityCity>
					<ns1:FacilityZip>12345</ns1:FacilityZip>
					<ns1:FacilityPhone>123</ns1:FacilityPhone>
					<ns1:FacilityFax>123</ns1:FacilityFax>
					<ns1:FacilityState>123</ns1:FacilityState>
					<ns1:PostAcuteProvider>123</ns1:PostAcuteProvider>
					<ns1:RemindDays>123</ns1:RemindDays>
					<ns1:DischargeDate>12-12-16</ns1:DischargeDate>
					<ns1:TransferDate>12-12-15</ns1:TransferDate>
				</ns1:dischargeInfo>
				<ns1:dischargeInfo>
					<ns1:DischargeInfoId>123</ns1:DischargeInfoId>
					<ns1:ReferralTrackerId>123</ns1:ReferralTrackerId>
					<ns1:DischartgeToType>Home</ns1:DischartgeToType>
					<ns1:DischargeWithType>123</ns1:DischargeWithType>
					<ns1:AgencyName>123</ns1:AgencyName>
					<ns1:AgencyAddress>123</ns1:AgencyAddress>
					<ns1:AgencyPhone>123</ns1:AgencyPhone>
					<ns1:AgencyFAX>123</ns1:AgencyFAX>
					<ns1:FacilityTypeId>123</ns1:FacilityTypeId>
					<ns1:FacilityType>123</ns1:FacilityType>
					<ns1:FacilityName>123</ns1:FacilityName>
					<ns1:FacilityAddress>123</ns1:FacilityAddress>
					<ns1:FacilityCity>123</ns1:FacilityCity>
					<ns1:FacilityZip>12345</ns1:FacilityZip>
					<ns1:FacilityPhone>123</ns1:FacilityPhone>
					<ns1:FacilityFax>123</ns1:FacilityFax>
					<ns1:FacilityState>123</ns1:FacilityState>
					<ns1:PostAcuteProvider>123</ns1:PostAcuteProvider>
					<ns1:RemindDays>123</ns1:RemindDays>
					<ns1:DischargeDate>12-12-16</ns1:DischargeDate>
					<ns1:TransferDate>12-12-15</ns1:TransferDate>
				</ns1:dischargeInfo>
				<ns1:insuranceInfo>
					<ns1:PrimaryInsuranceTypeId>123</ns1:PrimaryInsuranceTypeId>
					<ns1:PrimaryCompanyName>123</ns1:PrimaryCompanyName>
					<ns1:OtherPrimaryInsurance>123</ns1:OtherPrimaryInsurance>
					<ns1:PrimaryCardHolderName>123</ns1:PrimaryCardHolderName>
					<ns1:PrimaryCardHolderSSN>123</ns1:PrimaryCardHolderSSN>
					<ns1:PrimaryPatientGroupId>123</ns1:PrimaryPatientGroupId>
					<ns1:PrimaryPatientMemberId>123</ns1:PrimaryPatientMemberId>
					<ns1:SecondaryInsuranceTypeId>123</ns1:SecondaryInsuranceTypeId>
					<ns1:SecondaryCompanyName>123</ns1:SecondaryCompanyName>
					<ns1:OtherSecondaryInsurance>123</ns1:OtherSecondaryInsurance>
					<ns1:SecondaryCardHolderName>123</ns1:SecondaryCardHolderName>
					<ns1:SecondaryCardHolderSSN>123</ns1:SecondaryCardHolderSSN>
					<ns1:SecondaryPatientGroupId>123</ns1:SecondaryPatientGroupId>
					<ns1:SecondaryPatientMemberId>123</ns1:SecondaryPatientMemberId>
					<ns1:AdditionalInsuranceInfo>123</ns1:AdditionalInsuranceInfo>
				</ns1:insuranceInfo>
				<ns1:appointmentInfo>
					<ns1:AppointmentId>123</ns1:AppointmentId>
					<ns1:ScheduledTime>12-12-15</ns1:ScheduledTime>
					<ns1:ScheduleType>123</ns1:ScheduleType>
					<ns1:AppointmentNote>123</ns1:AppointmentNote>
					<ns1:Status>123</ns1:Status>
					<ns1:OtherAppointmentPreference>123
					</ns1:OtherAppointmentPreference>
					<ns1:OtherPatientToBeSeenWithIn>123
					</ns1:OtherPatientToBeSeenWithIn>
				</ns1:appointmentInfo>
				<ns1:appointmentInfo>
					<ns1:AppointmentId>123</ns1:AppointmentId>
					<ns1:ScheduledTime>12-12-15</ns1:ScheduledTime>
					<ns1:ScheduleType>123</ns1:ScheduleType>
					<ns1:AppointmentNote>123</ns1:AppointmentNote>
					<ns1:Status>123</ns1:Status>
					<ns1:OtherAppointmentPreference>123
					</ns1:OtherAppointmentPreference>
					<ns1:OtherPatientToBeSeenWithIn>123
					</ns1:OtherPatientToBeSeenWithIn>
				</ns1:appointmentInfo>
				<ns1:appointmentInfo>
					<ns1:AppointmentId>123</ns1:AppointmentId>
					<ns1:ScheduledTime>12-12-15</ns1:ScheduledTime>
					<ns1:ScheduleType>123</ns1:ScheduleType>
					<ns1:AppointmentNote>123</ns1:AppointmentNote>
					<ns1:Status>123</ns1:Status>
					<ns1:OtherAppointmentPreference>123
					</ns1:OtherAppointmentPreference>
					<ns1:OtherPatientToBeSeenWithIn>123
					</ns1:OtherPatientToBeSeenWithIn>
				</ns1:appointmentInfo>
				<ns1:appointmentInfo>
					<ns1:AppointmentId>123</ns1:AppointmentId>
					<ns1:ScheduledTime>12-12-15</ns1:ScheduledTime>
					<ns1:ScheduleType>123</ns1:ScheduleType>
					<ns1:AppointmentNote>123</ns1:AppointmentNote>
					<ns1:Status>123</ns1:Status>
					<ns1:OtherAppointmentPreference>123
					</ns1:OtherAppointmentPreference>
					<ns1:OtherPatientToBeSeenWithIn>123
					</ns1:OtherPatientToBeSeenWithIn>
				</ns1:appointmentInfo>
				<ns1:appointmentInfo>
					<ns1:AppointmentId>123</ns1:AppointmentId>
					<ns1:ScheduledTime>12-12-15</ns1:ScheduledTime>
					<ns1:ScheduleType>123</ns1:ScheduleType>
					<ns1:AppointmentNote>123</ns1:AppointmentNote>
					<ns1:Status>123</ns1:Status>
					<ns1:OtherAppointmentPreference>123
					</ns1:OtherAppointmentPreference>
					<ns1:OtherPatientToBeSeenWithIn>123
					</ns1:OtherPatientToBeSeenWithIn>
				</ns1:appointmentInfo>
			</ns1:referralInfo>
		</ns0:carmaRecord>
	</soap:Body>
</soap:Envelope>